package ru.sberbank.edu;

/**
 Реализовать класс CustomArrayImpl<T>, который представляет динамический массив

 Класс CustomArrayImpl реализует интерфейс CustomArray

 Класс CustomArrayImpl может хранить объекты любого типа

 Класс CustomArrayImpl может динамически расширяться

 Изучить внутреннюю реализацию ArrayList
 */
public class App
{
    public static void main( String[] args )
    {
        System.out.println("Hello World");
    }
}